Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ЗАПИСЬ

Функция УстановитьВремяДоступа(Знач Пользователь, Знач ДатаНачалаДоступа = Неопределено, Знач ДатаОкончанияДоступа, Знач СкрытьВремя = Ложь, Отказ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ВремяДоступаПользователейСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда	
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		Если ДатаНачалаДоступа = Неопределено Тогда
			НоваяЗапись.ДатаНачалаДоступа = ТекущаяДатаСеанса();
		Иначе
			НоваяЗапись.ДатаНачалаДоступа = ДатаНачалаДоступа;
		КонецЕсли;
		
	Иначе
		
		НоваяЗапись = НаборЗаписей[0];
		
		Если НЕ ЗначениеЗаполнено(НоваяЗапись.ДатаНачалаДоступа) Тогда // Дату начала доступа не меняем, если она заполнена.
			
			Если ДатаНачалаДоступа = Неопределено Тогда
				НоваяЗапись.ДатаНачалаДоступа = ТекущаяДатаСеанса();
			Иначе
				НоваяЗапись.ДатаНачалаДоступа = ДатаНачалаДоступа;
			КонецЕсли;

		КонецЕсли;		
		
	КонецЕсли;	
	
	НоваяЗапись.Пользователь = Пользователь;	
	НоваяЗапись.ДатаОкончанияДоступа = ДатаОкончанияДоступа;
	
	ЗаполнитьЗаписьДоступа(НоваяЗапись, НоваяЗапись, Отказ, СкрытьВремя);
	
	Если НЕ Отказ Тогда	
		НаборЗаписей.Записать();		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьЗаписьДоступа(ТекущийОбъект, Запись, Отказ, СкрытьВремя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаНачалаДоступа)
		И ЗначениеЗаполнено(ТекущийОбъект.ДатаОкончанияДоступа)
		И ТекущийОбъект.ДатаНачалаДоступа > ТекущийОбъект.ДатаОкончанияДоступа Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 - дата начала доступа не может быть больше даты окончания'"), Строка(ТекущийОбъект.Пользователь));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
		
	КонецЕсли;	
	
	ТекущийОбъект.ДатаИзменения = ТекущаяДатаСеанса();
	ТекущийОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Если СкрытьВремя Тогда
		
		ТекущийОбъект.ДатаНачалаДоступа = НачалоДня(Запись.ДатаНачалаДоступа);
		ТекущийОбъект.ДатаОкончанияДоступа = КонецДня(Запись.ДатаОкончанияДоступа);
			
	КонецЕсли;	
	
	Если НачалоДня(Запись.ДатаНачалаДоступа) = Дата("00010101") Тогда
		ТекущийОбъект.ДатаНачалаДоступа = Дата("00010101");
	КонецЕсли;
	
	Если НачалоДня(Запись.ДатаОкончанияДоступа) = Дата("00010101") Тогда
		ТекущийОбъект.ДатаОкончанияДоступа = Дата("00010101");
	КонецЕсли;	
	
КонецПроцедуры

// ЧТЕНИЕ

Функция ДоступПользователюРазрешен(Знач Пользователь = Неопределено, Знач НаДату = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяДоступаПользователейСУО.ДатаНачалаДоступа КАК ДатаНачалаДоступа,
		|	ВремяДоступаПользователейСУО.ДатаОкончанияДоступа КАК ДатаОкончанияДоступа
		|ИЗ
		|	РегистрСведений.ВремяДоступаПользователейСУО КАК ВремяДоступаПользователейСУО
		|ГДЕ
		|	ВремяДоступаПользователейСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ДоступРазрешен(ВыборкаДетальныеЗаписи.ДатаНачалаДоступа, ВыборкаДетальныеЗаписи.ДатаОкончанияДоступа, НаДату);
		
КонецФункции

Функция ТаблицаВремениДоступа(Знач Пользователи, НаДату = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяДоступаПользователейСУО.ДатаНачалаДоступа,
		|	ВремяДоступаПользователейСУО.ДатаОкончанияДоступа,
		|	ВремяДоступаПользователейСУО.Пользователь
		|ИЗ
		|	РегистрСведений.ВремяДоступаПользователейСУО КАК ВремяДоступаПользователейСУО
		|ГДЕ
		|	ВремяДоступаПользователейСУО.Пользователь В(&Пользователи)";
	
	Запрос.УстановитьПараметр("Пользователи", Пользователи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоступа = РезультатЗапроса.Выгрузить();
	
	ТаблицаДоступа.Колонки.Добавить("ДоступРазрешен");
	
	Для каждого Строка Из ТаблицаДоступа Цикл	
		Строка.ДоступРазрешен = ДоступРазрешен(Строка.ДатаНачалаДоступа, Строка.ДатаОкончанияДоступа, НаДату);	
	КонецЦикла;	
	
	Возврат ТаблицаДоступа;
	
КонецФункции

Функция ДатыДоступа(Знач Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяДоступаПользователейСУО.ДатаНачалаДоступа КАК ДатаНачалаДоступа,
		|	ВремяДоступаПользователейСУО.ДатаОкончанияДоступа КАК ДатаОкончанияДоступа
		|ИЗ
		|	РегистрСведений.ВремяДоступаПользователейСУО КАК ВремяДоступаПользователейСУО
		|ГДЕ
		|	ВремяДоступаПользователейСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат Новый Структура("ДатаНачалаДоступа, ДатаОкончанияДоступа", ВыборкаДетальныеЗаписи.ДатаНачалаДоступа, ВыборкаДетальныеЗаписи.ДатаОкончанияДоступа);
	
КонецФункции

Функция ЕстьЗаписи() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВремяДоступаПользователейСУО.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ВремяДоступаПользователейСУО КАК ВремяДоступаПользователейСУО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// СЕРВИС

Процедура ДобавитьОткрытоеОбучениеДляПерепроведения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.Проведен = ИСТИНА
		|	И ПроведениеОбученияСУО.ОткрытоеМероприятие = ИСТИНА
		|	И (ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Запланировано)
		|			ИЛИ ПроведениеОбученияСУО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПроведенияОбъектовСУО.Активно))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,,3);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ДоступРазрешен(ДатаНачалаДоступа, ДатаОкончанияДоступа, НаДату) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДоступНачался = Истина;
	
	Если ЗначениеЗаполнено(ДатаНачалаДоступа)
		И ДатаНачалаДоступа > НаДату Тогда
		
		ДоступНачался = Ложь;
		
	КонецЕсли;
	
	ДоступЗавершен = Ложь;
	
	Если ЗначениеЗаполнено(ДатаОкончанияДоступа)
		И ДатаОкончанияДоступа < НаДату Тогда
		
		ДоступЗавершен = Истина;
		
	КонецЕсли;
	
	Возврат ?(ДоступНачался И НЕ ДоступЗавершен, Истина, Ложь);	
	
КонецФункции

#КонецОбласти

#КонецЕсли
